In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Emp_Records.csv") # CSV File Read

In [3]:
df.head(5) #Top 5 rows Display

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont

In [9]:
df.tail() #Bottem 5 rows Display

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [5]:
df.shape #Shape of rows and Columns

(100, 7)

In [7]:
df.columns #Colamns Name

Index(['Emp ID', 'First Name', 'Age in Yrs', 'Weight in Kgs', 'Age in Company',
       'Salary', 'City'],
      dtype='object')

In [8]:
df.index #Rage of Data Set

RangeIndex(start=0, stop=100, step=1)

In [11]:
df.info() #Information of Table Columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Emp ID          100 non-null    int64
 1   First Name      100 non-null    object
 2   Age in Yrs      100 non-null    float64
 3   Weight in Kgs   100 non-null    int64
 4   Age in Company  100 non-null    float64
 5   Salary          100 non-null    int64
 6   City            100 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 5.6+ KB

In [15]:
df.isnull().sum() #Count of Null Values

Emp ID            0
First Name        0
Age in Yrs        0
Weight in Kgs     0
Age in Company    0
Salary            0
City              0
dtype: int64

In [13]:
df["Emp ID"] #Selecting Single column

0     677509
1     940761
2     428945
3     408351
4     193819
       ...
95    639892
96    704709
97    461593
98    392491
99    495141
Name: Emp ID, Length: 100, dtype: int64

In [14]:
df[["Emp ID","First Name"]] #one or more column select then pass list of column

    Emp ID First Name
0   677509       Lois
1   940761     Brenda
2   428945        Joe
3   408351      Diane
4   193819   Benjamin
..     ...        ...
95  639892       Jose
96  704709     Harold
97  461593     Nicole
98  392491    Theresa
99  495141      Tammy

[100 rows x 2 columns]

In [16]:
df.describe()   #Mean max min  all standered deviations

             Emp ID  Age in Yrs  Weight in Kgs  Age in Company         Salary
count     100.00000  100.000000     100.000000      100.000000     100.000000
mean   547652.10000   39.238700      58.080000        8.978400  119738.090000
std    257664.16679   12.066252      12.294106        8.657358   46185.278194
min    134841.00000   21.100000      40.000000        0.020000   42005.000000
25%    328643.75000   28.177500      50.000000        2.152500   83979.750000
50%    497414.00000   37.595000      56.000000        6.435000  118049.500000
75%    766040.00000   49.900000      61.250000       13.762500  162509.250000
max    979607.00000   59.470000      90.000000       34.520000  197537.000000

In [17]:
df[0:3] #Selecting rows using square brackets

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown

In [19]:
df.iloc[0:2,0:3] #Selecting Rows with iloc slicing

   Emp ID First Name  Age in Yrs
0  677509       Lois       36.36
1  940761     Brenda       47.02

In [20]:
df.iloc[[2,3],[1,2,3]]   #Selecting Rows with iloc with list

  First Name  Age in Yrs  Weight in Kgs
2        Joe       54.15             68
3      Diane       39.67             51

In [22]:
df.loc[0:3]   #Selecting Rows with loc with list

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown

In [23]:
df1 = pd.read_csv("Emp_Records.csv",index_col="City") # Changed the index of row in table
df1.head()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary
City,,,,,,
Denver,677509,Lois,36.36,60,13.68,168251
Stonewall,940761,Brenda,47.02,60,9.01,51063
Michigantown,428945,Joe,54.15,68,0.98,50155
Hydetown,408351,Diane,39.67,51,18.30,180294
Fremont,193819,Benjamin,40.31,58,4.01,117642

In [26]:
df1.loc[["Denver"]]  #Select rows

        Emp ID First Name  Age in Yrs  Weight in Kgs  Age in Company  Salary
City
Denver  677509       Lois       36.36             60           13.68  168251

In [27]:
df1.loc[["Denver","Stonewall"]]  #Select multiple rows

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary
City,,,,,,
Denver,677509,Lois,36.36,60,13.68,168251
Stonewall,940761,Brenda,47.02,60,9.01,51063

In [29]:
df1.loc[["Denver","Stonewall"],["Emp ID","First Name"]] #Select rows and column

           Emp ID First Name
City
Denver     677509       Lois
Stonewall  940761     Brenda

In [30]:
df1.reset_index()

,City,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary
0,Denver,677509,Lois,36.36,60,13.68,168251
1,Stonewall,940761,Brenda,47.02,60,9.01,51063
2,Michigantown,428945,Joe,54.15,68,0.98,50155
3,Hydetown,408351,Diane,39.67,51,18.30,180294
4,Fremont,193819,Benjamin,40.31,58,4.01,117642
...,...,...,...,...,...,...,...
95,Biloxi,639892,Jose,22.82,89,1.05,129774
96,Carol Stream,704709,Harold,32.61,77,5.93,156194
97,Detroit,461593,Nicole,52.66,60,28.53,95673
98,Mc Grath,392491,Theresa,29.60,57,6.99,51015
99,Alma,495141,Tammy,38.38,55,2.26,93650

In [34]:
ser = df1["Age in Company"]

In [36]:
ser.dtype

dtype('float64')

In [37]:
ser.max()

34.52

In [38]:
ser.min()

0.02